app/views/main/index.html.erb

      <li><%= link_to t("hrinfos.index.title"), :controller => "hrinfos" %></li>
      <% if @user.permission.any? {|perm| perm.name == 'users'}  %>
---
SELECT "permissions".* FROM "permissions" INNER JOIN "permissions_users" ON "permissions"."id" = "permissions_users"."permission_id" WHERE "permissions_users"."user_id" = 1