app/views/documents/edit.html.erb

SELECT "users".* FROM "users" INNER JOIN "document_owners" ON "users"."id" = "document_owners"."user_id" WHERE "document_owners"."document_id" = 4
---
    <%= f.label :owners, Document.human_attribute_name('owner') %>
    <% if !@document.users.blank? %>

SELECT "tags".* FROM "tags" INNER JOIN "documents_tags" ON "tags"."id" = "documents_tags"."tag_id" WHERE "documents_tags"."document_id" = 4
---
    <%= f.label :tags, Document.human_attribute_name('tags') %>
    <% if !@document.tags.blank? %>