app/views/documents/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "document_owners" ON "users"."id" = "document_owners"."user_id" WHERE "document_owners"."document_id" = 3
---
		<td>
		<% if !document.users.blank? %>

SELECT "tags".* FROM "tags" INNER JOIN "documents_tags" ON "tags"."id" = "documents_tags"."tag_id" WHERE "documents_tags"."document_id" = 3
---
		<td>
			<% if !document.tags.blank? %>