app/controllers/cardbills_controller.rb

SELECT "cardbills".* FROM "cardbills" ORDER BY transdate desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "cardbills"
---
  def index
#    @cardbills = Cardbill.paginate(:order => 'transdate desc', :page => params[:page], :per_page => 20)
    @cardbills = Cardbill.search(params[:q]).searchbycreditcard(params[:creditcard_id]).paginate(:order => 'transdate desc', :page => params[:page], :per_page => 20)

SELECT "cardbills".* FROM "cardbills" WHERE "cardbills"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cardbill = Cardbill.find(params[:id])

SELECT "cardbills".* FROM "cardbills" WHERE "cardbills"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "creditcards".* FROM "creditcards"
---
  def edit
    @cardbill = Cardbill.find(params[:id])
    @creditcards = Creditcard.all

SELECT "cardbills".* FROM "cardbills" WHERE "cardbills"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "creditcards".* FROM "creditcards"
UPDATE "cardbills" SET "amount" = 30000.0, "vat" = 20000.0, "servicecharge" = 10.0, "totalamount" = 20.0, "storename" = '밥먹는데', "storeaddr" = '체인점', "approveno" = '999', "updated_at" = '2012-04-05 08:24:06.005720' WHERE "cardbills"."id" = 1
---
  def update
    @cardbill = Cardbill.find(params[:id])
    @creditcards = Creditcard.all

    respond_to do |format|
      if @cardbill.update_attributes(params[:cardbill])