app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" INNER JOIN "document_owners" ON "documents"."id" = "document_owners"."document_id" WHERE "document_owners"."user_id" = 1 AND (title like '%%') ORDER BY id desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "documents" INNER JOIN "document_owners" ON "documents"."id" = "document_owners"."document_id" WHERE "document_owners"."user_id" = 1 AND (title like '%%')
---
  def index
    #@documents = @user.documents.find(:all, :order => "created_at DESC")
    # @documents = Document.all
    q = params[:q]
    if q.nil?
      q = ""
    end
    # @documents = @user.documents.find(:all,:conditions => ["title like ?", "%"+q+"%"],:order => 'id desc').paginate(:page => params[:page], :per_page => 20)
    @documents = @user.documents.where("title like ?", "%#{q}%").order('id desc').paginate(:page => params[:page], :per_page => 20)

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "3"]]
SELECT 1 FROM "users" INNER JOIN "document_owners" ON "users"."id" = "document_owners"."user_id" WHERE "document_owners"."document_id" = 3 AND "users"."id" = 1 LIMIT 1
---
  def show
    @document = Document.find(params[:id])
    unless @document.users.include? @user

SELECT "users".* FROM "users" WHERE "users"."name" = 'paranoiase' LIMIT 1
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "4"]]
SELECT 1 FROM "users" INNER JOIN "document_owners" ON "users"."id" = "document_owners"."user_id" WHERE "document_owners"."document_id" = 4 AND "users"."id" = 1 LIMIT 1
---
  def add_owner
    owner = User.find_by_name(params[:username]);
    document = Document.find(params[:id])
    if owner
      if document.users.include? (owner)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "4"]]
---
  def remove_owner
    owner = User.find(params[:uid])
    document = Document.find(params[:id])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @document = Document.find(params[:id])

INSERT INTO "documents" ("created_at", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 05 Apr 2012 08:27:54 UTC +00:00], ["project_id", 2], ["title", "완료된 문서"], ["updated_at", Thu, 05 Apr 2012 08:27:54 UTC +00:00]]
---
  def create
    @document = Document.new(params[:document])
    @document.users << @user

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "documents" SET "title" = '테스트 문서2', "project_id" = 1, "updated_at" = '2012-04-05 08:28:07.199470' WHERE "documents"."id" = 4
---
  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 4]]
---
  def destroy
    @document = Document.find(params[:id])
    @attachments = Attachment.for_me(@document)
    @attachments.each do |attach| attach.destroy end