app/controllers/hrinfos_controller.rb

SELECT "hrinfos".* FROM "hrinfos" WHERE (retired_on IS NOT NULL)
SELECT COUNT(*) FROM "hrinfos" WHERE (retired_on IS NOT NULL)
---
  def index
    retired = params[:retired]
    if retired == "on"
      @hrinfos = Hrinfo.find(:all, :conditions => "retired_on IS NOT NULL")
      @hrinfos_count = Hrinfo.count(:all, :conditions => "retired_on IS NOT NULL")

SELECT "hrinfos".* FROM "hrinfos" WHERE "hrinfos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "required_tags".* FROM "required_tags" WHERE "required_tags"."modelname" = 'Hrinfo'
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'paranoiase' LIMIT 1
---
  def show
    @hrinfo = Hrinfo.find(params[:id])
    @attachments = Attachment.for_me(@hrinfo, "seq ASC")
    at = params[:at] || "0"
   unless @attachments.empty?
      if session[:attachments].nil?
        session[:attachments] = [@attachments[at.to_i].id]
      else
        session[:attachments] << @attachments[at.to_i].id
      end
   end
    @related_documents = Tag.related_documents(@hrinfo.user.name, Hrinfo.model_name.human)
    @required_tagnames = RequiredTag.find_all_by_modelname(Hrinfo.name).collect do |rt| rt.tag.name end
    @required_tagnames = @required_tagnames.uniq.sort

    @required_documents = {}
    @unrequired_documents = []
    @related_documents.each do |rd|

SELECT "users".* FROM "users" WHERE (id not in (select user_id from hrinfos))
---
  def new
    @hrinfo = Hrinfo.new
    @users = User.nohrinfo

    if @users.blank?

INSERT INTO "hrinfos" ("address", "companyno", "created_at", "email", "firstname", "joined_on", "juminno", "lastname", "mphone", "picture_id", "position", "retired_on", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hrinfo = Hrinfo.new(params[:hrinfo])
    @users = User.nohrinfo

    respond_to do |format|
      if @hrinfo.save