app/controllers/namecards_controller.rb

SELECT "namecards".* FROM "namecards" ORDER BY id desc LIMIT 20 OFFSET 0
---
  def index
#    @namecards = Namecard.order('id desc').paginate(:page => params[:page], :per_page => 20)
    @namecards = Namecard.search(params[:q]).order('id desc').paginate(:page => params[:page], :per_page => 20)

INSERT INTO "namecards" ("company", "created_at", "department", "email", "homepage", "jobtitle", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @namecard = Namecard.new(params[:namecard])

    respond_to do |format|
      if @namecard.save

SELECT "namecards".* FROM "namecards" WHERE "namecards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @namecard = Namecard.find(params[:id])

SELECT "namecards".* FROM "namecards" WHERE "namecards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @namecard = Namecard.find(params[:id])

SELECT "namecards".* FROM "namecards" WHERE "namecards"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "namecards" SET "jobtitle" = '꽝꽝22', "updated_at" = '2012-04-05 08:14:31.496941' WHERE "namecards"."id" = 1
---
  def update
    @namecard = Namecard.find(params[:id])

    respond_to do |format|
      if @namecard.update_attributes(params[:namecard])