app/controllers/pettycashes_controller.rb

SELECT "pettycashes".* FROM "pettycashes" ORDER BY transdate desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "pettycashes"
SELECT SUM("pettycashes"."inmoney") AS sum_id FROM "pettycashes"
SELECT SUM("pettycashes"."outmoney") AS sum_id FROM "pettycashes"
---
  def index
    @pettycashes = Pettycash.search(params[:q]).paginate(:order => 'transdate desc', :page => params[:page], :per_page => 20)
    inmoney_total = Pettycash.sum(:inmoney)
    outmoney_total = Pettycash.sum(:outmoney)

SELECT "pettycashes".* FROM "pettycashes" WHERE "pettycashes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @pettycash = Pettycash.find(params[:id])

SELECT "pettycashes".* FROM "pettycashes" WHERE "pettycashes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @pettycash = Pettycash.find(params[:id])

INSERT INTO "pettycashes" ("attachment_id", "created_at", "description", "inmoney", "outmoney", "transdate", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pettycash = Pettycash.new(params[:pettycash])

    respond_to do |format|
      if @pettycash.save

SELECT "pettycashes".* FROM "pettycashes" WHERE "pettycashes"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pettycashes" SET "inmoney" = 30000.0, "outmoney" = 50000.0, "description" = '좋은데 썼음', "updated_at" = '2012-04-05 08:23:24.927230' WHERE "pettycashes"."id" = 4
---
  def update
    @pettycash = Pettycash.find(params[:id])

    respond_to do |format|
      if @pettycash.update_attributes(params[:pettycash])