app/controllers/projects_controller.rb

  def del_user
    @project = Project.find(params[:id])
    @user = User.find(params[:uid])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def add_user
    @project = Project.find(params[:id])
    @user = User.find_by_name(params[:username])

    if @user
      if @project.users.include? @user
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."name" = 'paranoiase' LIMIT 1
SELECT 1 FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = 1 AND "users"."id" = 1 LIMIT 1