app/controllers/users_controller.rb

  def create
    @this_user = User.new(params[:user])
    @this_user.companies << current_company
---
INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def changepw
    if request.post?
      this_user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]