app/views/hrinfos/new.html.erb

SELECT 1 FROM "hrinfos" WHERE "hrinfos"."companyno" = 1 LIMIT 1
---
    <%= f.label :companyno, Hrinfo.human_attribute_name('companyno') %>
    <%= f.text_field :companyno, value: Hrinfo.count %>