app/views/hrinfos/show.html.erb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'paranoiase' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
            <% else %>
              <%= link_to "Register", :controller => "documents", :action => "new", :tag => [rtn, Hrinfo.model_name.human, @hrinfo.user.name].join(',') %>

SELECT "hrinfo_histories".* FROM "hrinfo_histories" WHERE "hrinfo_histories"."hrinfo_id" = 1
---
    <h3><%= t(".changes") %></h3>
    <% if !@hrinfo.hrinfo_histories.blank? %>